dataset_gen/NS_BB_openfoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
16384
(
(1.2039286982194754e-13 9.57057599739706e-12 0.0)
(-0.41340689297573385 1.8155352898050947 0.0)
(0.367784161519503 -0.32121976890087117 0.0)
(-0.5660411673807054 -4.815928593820436 0.0)
(-0.3630700863211479 -0.26855155048933915 0.0)
(-0.16364980586077982 -1.8539863122540001 0.0)
(-0.08773874549184638 -0.06138572914445324 0.0)
(-0.04275544323755132 -1.1329194926400357 0.0)
...
);

boundaryField
{
    left
    {
        type cyclic;
    }
    right
    {
        type cyclic;
    }
    bottom
    {
        type cyclic;
    }
    top
    {
        type cyclic;
    }
    frontAndBack
    {
        type empty;
    }
}
